{
    "syllabus": {
        "chapter1": "Foundations: Vectors, Scalars, and Basic Kinematics",
        "chapter2": "Force, Motion, and Newton's Laws: Essential Applications",
        "chapter3": "Work, Energy, and Power: Problem-Solving Approaches",
        "chapter4": "Rotational Motion: Concepts, Torque, and Angular Momentum",
        "chapter5": "Simple Harmonic Motion and Oscillations: Analysis and Variations"
    },
    "chapters": {
        "chapter5": "# Simple Harmonic Motion and Oscillations: Analysis and Variations\n\n**Introduction**\n\nWelcome to the crucial chapter on Simple Harmonic Motion (SHM) and Oscillations! In previous chapters, we've laid the groundwork for understanding forces and energy, and now we're going to use those concepts to explore a very specific, and remarkably common, type of motion: oscillatory motion. While not all oscillations are simple harmonic, SHM is a particularly beautiful and tractable case that serves as a building block for understanding more complex systems. This chapter will not only define SHM but also delve into its analysis, variations, and how it relates to the energy of the system. Get ready to understand a fundamental aspect of physics that shows up everywhere, from clocks to atoms.\n\n**What is Oscillatory Motion?**\n\nBefore we jump into SHM, let’s define oscillations. Oscillatory motion is any repetitive motion back and forth around a central or equilibrium position. Think of a swing, a pendulum, or a vibrating string on a guitar. These are all examples of oscillatory motion. Key characteristics of oscillatory motion are:\n\n*   **Equilibrium Position:** The position where there’s no net force on the object.\n*   **Displacement:** The distance of the object from the equilibrium position.\n*   **Restoring Force:** A force that always pulls the object back toward the equilibrium position.\n\n**Introducing Simple Harmonic Motion (SHM)**\n\nSimple Harmonic Motion is a *special* type of oscillatory motion. It's characterized by a very specific relationship between the restoring force and the displacement:\n\n*   **Restoring Force is Proportional to Displacement:** In SHM, the restoring force is directly proportional to the displacement and acts in the opposite direction. Mathematically, this is expressed as:\n\n    *   *F = -kx*\n\n        *   Where:\n            *   *F* is the restoring force.\n            *   *x* is the displacement from the equilibrium position.\n            *   *k* is a positive constant called the spring constant (or force constant). The negative sign indicates that the force opposes the displacement.\n\n*   **Constant Amplitude and Frequency:** An ideal SHM continues indefinitely with the same maximum displacement (amplitude) and oscillates with the same frequency. In reality, friction and other dissipative forces will cause these values to change over time (damped oscillations).\n\n**Mathematical Description of SHM**\n\nThe equation *F = -kx* is a crucial starting point, but we can derive a lot more from it. Let's use Newton’s second law, *F = ma*:\n\n*   *ma = -kx*\n\n    *   Where *m* is the mass of the object and *a* is its acceleration.\n\n*   Rearranging, we get: *a = -(k/m)x*\n\n    *   This shows that the acceleration is proportional to the displacement and also acts in the opposite direction.\n*   This leads us to a very important relationship – the angular frequency (*ω*): *ω² = k/m* or *ω = √(k/m)*\n*   The differential equation describing SHM is thus:\n\n    *   *d²x/dt² + ω²x = 0*\n\n        *   Where d²x/dt² is the second derivative of displacement with respect to time (i.e., acceleration).\n\n*   The general solution to this differential equation is:\n\n    *   *x(t) = A cos(ωt + φ)*\n\n        *   Where:\n            *   *x(t)* is the displacement as a function of time.\n            *   *A* is the amplitude (maximum displacement).\n            *   *ω* is the angular frequency (rad/s).\n            *   *t* is the time.\n            *   *φ* is the phase constant (initial phase, determines the position of the object at t=0)\n\n**Key Parameters of SHM**\n\nLet’s break down the crucial parameters of SHM further:\n\n1.  **Amplitude (A):** The maximum displacement from the equilibrium position. It determines the \"extent\" of the oscillation. The unit of amplitude is meters (m).\n\n2.  **Angular Frequency (ω):** It’s related to the speed of oscillation.  *ω = 2πf = 2π/T*, where *f* is the frequency (in Hertz) and *T* is the period (in seconds).\n    *   Frequency (f): The number of complete oscillations per second (unit: Hertz, Hz).\n    *   Period (T): The time taken for one complete oscillation (unit: seconds, s).\n\n3.  **Phase Constant (φ):** Also known as the initial phase, this tells you the position of the object at t=0. It affects the starting point of the motion. Phase is measured in radians.\n\n**Graphical Representation of SHM**\n\nThe displacement-time graph of SHM is sinusoidal (a cosine or sine wave). The x(t) = A cos(ωt + φ) equation essentially dictates the shape of this graph:\n\n*   The *amplitude* dictates how \"tall\" the wave is.\n*   The *angular frequency* determines how \"squished\" or \"stretched out\" the wave is in the time dimension (determines the period).\n*   The *phase constant* shifts the whole graph left or right on the time axis.\n\n**Velocity and Acceleration in SHM**\n\nHaving a good understanding of displacement is crucial, but so are velocity and acceleration within SHM. These are calculated by taking the time derivatives of the displacement equation:\n\n1.  **Velocity (v(t)):**  The first derivative of displacement with respect to time.\n\n    *   *v(t) = -Aω sin(ωt + φ)*\n\n    *  Note that this is also a sinusoidal function but is out of phase with the displacement by π/2 radians. This means the velocity is maximum when displacement is zero (at equilibrium) and zero when the displacement is maximum (at the extremes).\n2.  **Acceleration (a(t)):** The first derivative of velocity with respect to time, or the second derivative of displacement.\n\n    *   *a(t) = -Aω² cos(ωt + φ)*\n    *   *a(t) = -ω²x(t)* (From here, you can see why a is proportional to x and in opposite directions)\n\n    *  Note again that acceleration is also sinusoidal but is in the opposite direction to the displacement, and also follows the same equation as the position with an added ω². Acceleration is maximum (in magnitude) when displacement is maximum and is zero at the equilibrium position.\n\n**Energy in SHM**\n\nSHM also provides a beautiful example of energy transformation and conservation:\n\n*   **Potential Energy (PE):** This is the energy stored in the system due to the displacement of the object from its equilibrium position. In the case of spring mass system, the potential energy is related to the extension/compression of the spring.\n    *   *PE = ½kx²*\n    *   Using the SHM solution *x(t) = A cos(ωt + φ)* , we can write:  *PE = ½kA²cos²(ωt + φ)*\n*   **Kinetic Energy (KE):** This is the energy possessed by the object due to its motion.\n    *   *KE = ½mv²*\n    *  Using the SHM solution *v(t) = -Aω sin(ωt + φ)*, we can write: *KE = ½mA²ω²sin²(ωt + φ)*\n    *   We know that *ω² = k/m*  so,  *KE = ½kA²sin²(ωt + φ)*\n\n*   **Total Mechanical Energy (E):** The sum of potential and kinetic energy.\n    *   *E = PE + KE*\n    *   *E = ½kA²cos²(ωt + φ)  + ½kA²sin²(ωt + φ) = ½kA²(cos²(ωt + φ) + sin²(ωt + φ))*\n    *   *E = ½kA²* (Since, *cos²θ + sin²θ = 1)*\n\n    *   **Key Insight:** The total mechanical energy of the system in SHM is constant and proportional to the square of the amplitude. This result is fundamental in understanding how energy is conserved in oscillatory systems. Note that in the absence of damping (friction), the total mechanical energy of the system remains constant. The energy continuously transforms from potential to kinetic and vice versa, but the total remains the same.\n\n**Variations of SHM**\n\nWhile a simple spring-mass system provides a clear demonstration of SHM, it’s useful to know that SHM can exist in other systems:\n\n*   **Simple Pendulum:** For small angle oscillations, the motion of a pendulum can be approximated as SHM. The restoring force is due to gravity.\n*   **LC Circuits:** In electrical circuits with an inductor (L) and capacitor (C), the charge and current oscillate with SHM (electrical oscillations).\n\n**Examples**\n\n1.  **Spring-Mass System:** A 0.5 kg mass is attached to a spring with a spring constant of 20 N/m.  Initially, it’s displaced by 0.1 m and released. Calculate:\n    *   Angular frequency (ω):  *ω = √(k/m) = √(20/0.5) = √40 ≈ 6.32 rad/s*\n    *   Period (T): *T = 2π/ω = 2π/6.32 ≈ 0.99 s*\n    *   Amplitude (A): 0.1 m (Given)\n    *   Total Energy (E): *E = ½kA² = ½ * 20 * (0.1)² = 0.1 J*\n\n2.  **Simple Pendulum:** A pendulum with a length of 1 meter oscillates with a small angle of displacement. Assuming *g = 9.8 m/s²*, calculate its period.\n    *    For a small-angle pendulum, the time period is given by *T = 2π√(L/g) = 2π√(1/9.8) ≈ 2.01 s*\n\n**Important Considerations**\n\n*   **Damping:** In real-world situations, friction and other dissipative forces cause the amplitude of SHM to decrease over time, leading to damped oscillations.\n*   **Forced Oscillations and Resonance:** If we apply an external periodic force to a system exhibiting SHM, we can induce forced oscillations. When the frequency of the external force matches the natural frequency of the system, we observe a phenomenon called resonance, where the amplitude of the oscillations becomes very large. This is a crucial concept for later chapters.\n\n**Conclusion**\n\nThis chapter on Simple Harmonic Motion and Oscillations has explored the fundamental principles of a very common type of motion. We've covered the mathematical description of SHM, its key parameters, its energy aspects, and variations of SHM. This foundation is crucial for the upcoming chapters that deal with waves and other complex phenomena. Remember the equation *F = -kx* and *x(t) = A cos(ωt + φ)*, as they are your constant companions for further study. Be sure to practice the examples provided to ensure you’re solid on the fundamentals before moving ahead.",
        "chapter1": "# Work, Energy, and Power: Problem-Solving Approaches\n\nWelcome to the rollercoaster of Work, Energy, and Power! In previous chapters, we've laid the foundation by understanding the basics of motion and forces. Now, we’re diving into a different, and often more convenient, way to analyze physical situations – through the lens of energy. This chapter isn’t about memorizing formulas; it's about understanding *how* to approach problems involving work, energy, and power. We’ll learn to recognize when these concepts are most useful and develop strategies to solve a variety of JEE-level problems.\n\n**1. Understanding the Concepts:**\n\nBefore we delve into problem-solving, let's quickly recap the fundamental concepts:\n\n*   **Work (W):** Work is done when a force causes a displacement. Mathematically, it's defined as:\n    *   `W = F * d * cos(θ)` where:\n        *   `F` is the magnitude of the force.\n        *   `d` is the magnitude of the displacement.\n        *   `θ` is the angle between the force and displacement vectors.\n    *   Key Takeaways:\n        *   Work is a scalar quantity (it has magnitude but no direction).\n        *   Work can be positive (force aiding motion), negative (force opposing motion), or zero (force perpendicular to motion or no displacement).\n        *   The unit of work is the Joule (J).\n*   **Kinetic Energy (KE):** This is the energy an object possesses due to its motion. It's given by:\n    *   `KE = 1/2 * m * v^2` where:\n        *   `m` is the mass of the object.\n        *   `v` is the speed of the object.\n    *   Key Takeaways:\n        *   KE is a scalar quantity and always positive (or zero).\n        *   It depends on the mass and *square* of the velocity, meaning speed has a significant impact.\n        *   The unit of KE is also the Joule (J).\n*   **Potential Energy (PE):** This is energy stored by an object due to its position or configuration. We’ll focus on two primary types:\n    *   **Gravitational Potential Energy (GPE):** `PE_g = m * g * h` where:\n        *   `m` is the mass of the object.\n        *   `g` is the acceleration due to gravity (approximately 9.8 m/s²).\n        *   `h` is the height of the object above a chosen reference level (the “zero” level of potential energy).\n    *   **Elastic Potential Energy (EPE):** `PE_e = 1/2 * k * x^2` where:\n        *   `k` is the spring constant (a measure of the stiffness of the spring).\n        *   `x` is the displacement of the spring from its equilibrium position.\n    *   Key Takeaways:\n        *   PE is also a scalar quantity.\n        *   Gravitational PE is relative – it depends on the chosen reference height.\n        *   Elastic PE is stored in deformable bodies like springs.\n*   **Power (P):** This is the rate at which work is done or the rate at which energy is transferred. It's given by:\n    *   `P = W / t` or `P = dE / dt` where:\n        *   `W` is the work done.\n        *   `t` is the time taken.\n        *   `dE` is the change in energy.\n    *   Key Takeaways:\n        *   Power is a scalar quantity.\n        *   The unit of power is the Watt (W), which is equivalent to J/s.\n        *   Power represents how quickly energy is being converted or used.\n*   **Work-Energy Theorem:** A crucial theorem that states: *The net work done on an object is equal to the change in its kinetic energy.*\n    *   `W_net = ΔKE = KE_final - KE_initial`\n    *   This theorem helps solve problems where the net work done by all forces is known, or when only the initial and final states are needed.\n*   **Conservation of Mechanical Energy:** In the absence of non-conservative forces (like friction or air resistance), the total mechanical energy (sum of KE and PE) of a system remains constant.\n    *   `KE_initial + PE_initial = KE_final + PE_final`\n    *   This principle is extremely powerful in solving a variety of problems, allowing us to relate initial and final states without having to deal with the details of the intermediate processes.\n\n**2. Problem-Solving Strategies: A Step-by-Step Approach**\n\nHere’s a structured way to tackle problems involving Work, Energy, and Power:\n\n1.  **Read and Understand the Problem:**\n    *   Carefully identify what’s given (initial velocity, mass, forces, distances, etc.) and what needs to be found.\n    *   Draw a clear diagram representing the situation. This is CRITICAL! Label all the forces, initial and final positions, and relevant distances.\n    *   Determine which quantities are scalars and which are vectors, and how they will interact.\n2.  **Identify Relevant Concepts:**\n    *   Decide whether work, kinetic energy, potential energy, power, or combinations of these concepts are involved in the problem.\n    *   Ask yourself: Are there non-conservative forces acting? Can we apply the Work-Energy Theorem or the conservation of energy?\n3.  **Choose the Appropriate Method:**\n    *   If the question involves finding changes in velocity due to a known force and displacement, consider using the **Work-Energy Theorem**.\n    *   If there are only conservative forces (like gravity or spring forces), and the question relates initial and final states, use the **Conservation of Mechanical Energy**.\n    *   If you’re dealing with the rate of doing work, use the definition of **Power**.\n    *   If you have the force, displacement, and angle between them, use the **definition of work**.\n4.  **Set up Equations:**\n    *   Write down all the relevant equations based on the concepts identified.\n    *   Substitute all the given information into your chosen equations.\n5.  **Solve the Equations:**\n    *   Perform the necessary mathematical calculations to arrive at the answer.\n6.  **Check Your Answer:**\n    *   Make sure the units are correct and that the answer makes sense within the context of the problem.\n    *   Does the answer seem physically reasonable? For example, a ball rolling down a hill cannot have a final KE that is lower than its initial KE, assuming no friction.\n\n**3. Illustrative Examples:**\n\nLet's work through a few examples to solidify our understanding:\n\n**Example 1: The Sledding Child**\n\n*   **Problem:** A child of mass 30 kg slides down a frictionless hill of height 5 meters. Starting from rest, what is their speed at the bottom of the hill?\n*   **Analysis:**\n    *   We have gravity (conservative force), initial rest state, and are looking for the final velocity. This screams conservation of mechanical energy.\n    *   Since the hill is frictionless, there is no energy loss.\n*   **Solution:**\n    *   `KE_initial + PE_initial = KE_final + PE_final`\n    *   Since the child starts at rest `KE_initial = 0`. Choose the bottom of the hill as h = 0, so `PE_final = 0`.\n    *   `0 + mgh = 1/2 * mv^2 + 0`\n    *   `30 kg * 9.8 m/s² * 5m = 1/2 * 30 kg * v^2`\n    *   Solving for v: `v = sqrt(2 * 9.8 * 5) ≈ 9.9 m/s`\n*   **Answer:** The speed at the bottom is approximately 9.9 m/s.\n\n**Example 2:  Pulling a Block**\n\n*   **Problem:** A 2 kg block is pulled across a horizontal surface with a force of 10 N at an angle of 30 degrees above the horizontal. The block is pulled a distance of 2 meters. If the surface is frictionless, what is the work done by the force and the final speed of the block if its initial speed was 1 m/s?\n*   **Analysis:**\n    *   We're given the force, displacement and angle. We can use `W=F*d*cos(theta)` to calculate the work done by the force and then use work-energy theorem to find the final speed.\n*   **Solution:**\n    *   Work done: `W = F * d * cos(θ) = 10 N * 2 m * cos(30°) ≈ 17.32 J`\n    *   Work-energy theorem: `W_net = ΔKE`\n    *   `17.32 J = 1/2 * 2kg * (v_final^2 - 1^2)`\n    *   `17.32 = v_final^2 - 1`\n    *   Solving for v_final: `v_final = sqrt(18.32) ≈ 4.28 m/s`\n*   **Answer:** The work done by the force is approximately 17.32 J and the final speed is approximately 4.28 m/s.\n\n**Example 3: Lifting a Box**\n\n*   **Problem:** A crane lifts a 500 kg box vertically upwards at a constant speed of 2 m/s. What is the power output of the crane?\n*   **Analysis:**\n    *   We need to determine power given a force (weight) and constant velocity. The work will be against gravity.\n*   **Solution:**\n    *   The force needed to lift at constant speed is equal to the weight of the box. Therefore `F=mg=500*9.8 = 4900 N`.\n    *   Power is `P = F * v` (since the force and velocity are parallel),\n    *   `P = 4900 N * 2 m/s = 9800 W` or 9.8 kW.\n*   **Answer:** The power output of the crane is 9800 Watts (or 9.8 kW).\n\n**4.  Moving Forward:**\n\nThis chapter is a crucial stepping stone. The ideas we've explored here are used extensively in other areas of physics, particularly in rotational motion and oscillations. Master these concepts, practice these problem-solving strategies, and you’ll be well-equipped to tackle tougher problems ahead! Remember, it's not about memorizing formulas but rather understanding the fundamental physics behind each scenario. Keep practicing, and you'll see that Work, Energy, and Power, while initially challenging, can be extremely powerful tools in your physics toolbox. Good luck!",
        "chapter2": "# Force, Motion, and Newton's Laws: Essential Applications\n\nOkay, everyone. Let's dive into a fundamental area of physics that's crucial for tackling JEE problems: Force, Motion, and Newton's Laws. We've already covered the basics in the previous chapters – what forces *are*, how to represent them, and Newton's three laws. Now, we're going to put those concepts into practice and see how they apply to real-world scenarios and the kind of problems you'll face on the JEE exam. This chapter is all about getting comfortable with *applying* what you know.\n\n**1. Recap: Newton's Laws of Motion**\n\nBefore we jump into applications, let’s quickly refresh our memory:\n\n*   **Newton’s First Law (Law of Inertia):** An object at rest stays at rest, and an object in motion stays in motion with the same speed and in the same direction unless acted upon by an unbalanced force. Essentially, objects resist changes in their state of motion.\n\n*   **Newton's Second Law:** The acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass.  Mathematically, this is expressed as **F = ma**, where F is the net force, m is the mass, and a is the acceleration. Remember, force and acceleration are vector quantities, meaning they have both magnitude and direction.\n\n*   **Newton's Third Law:** For every action, there is an equal and opposite reaction. If object A exerts a force on object B, object B will exert an equal force back on object A, but in the opposite direction. These action-reaction forces always act on *different* objects.\n\n**2. Free Body Diagrams (FBDs): The Cornerstone of Problem Solving**\n\nThe single most important skill for solving problems involving Newton's Laws is the ability to draw a **Free Body Diagram (FBD)**. An FBD isolates a single object and shows *all* the forces acting *on* that object. Here's a step-by-step guide:\n\n1.  **Isolate the object:** Imagine a circle or a dot representing the object you're analyzing.\n2.  **Identify all forces:** Consider all the forces acting on the object. Common forces include:\n    *   **Weight (W):** Force due to gravity, always acting downwards. W = mg, where g is the acceleration due to gravity (approximately 9.8 m/s² on Earth).\n    *   **Normal Force (N):** The force exerted by a surface on an object in contact with it, acting perpendicular to the surface.\n    *   **Tension (T):** Force exerted by a rope, string, or cable, acting along the direction of the rope.\n    *   **Friction (f):** A force that opposes motion between two surfaces in contact. We'll delve deeper into friction later.\n    *   **Applied Force (F_app):** Any force directly applied to the object (pushing, pulling, etc.).\n3.  **Draw vectors:** Represent each force as an arrow (vector) originating from the center of the object. The length of the arrow represents the magnitude of the force, and the direction of the arrow represents the direction of the force.\n4.  **Label the forces:** Label each force clearly (W, N, T, f, F_app, etc.).\n\n**Example 1: A Block on a Horizontal Surface**\n\nLet's consider a block of mass 'm' resting on a horizontal surface.\n\n1.  **Object:** The block.\n2.  **Forces:**\n    *   Weight (W = mg) acting downwards.\n    *   Normal force (N) acting upwards.\n3.  **FBD:** Draw a dot, an arrow pointing downwards labelled 'W', and an arrow pointing upwards labeled 'N'.\n4.  **Analysis:** Since the block is at rest, it's in equilibrium. According to Newton's First Law, the net force is zero. Therefore, N = W, or N = mg.\n\n**Example 2: A Block Being Pulled on a Horizontal Surface**\n\nNow, let's say the same block is being pulled horizontally by a force F_app.\n\n1.  **Object:** The block.\n2.  **Forces:**\n    *   Weight (W = mg) acting downwards.\n    *   Normal force (N) acting upwards.\n    *   Applied force (F_app) acting horizontally.\n    *   If there is friction between the block and the surface, a frictional force (f) opposing the motion will act horizontally.\n3.  **FBD:** Draw a dot, an arrow pointing downwards labelled 'W', an arrow pointing upwards labeled 'N', an arrow pointing to the right labeled 'F_app', and an arrow pointing to the left labelled 'f' (if friction is present).\n4.  **Analysis:** The block will accelerate in the horizontal direction. Applying Newton's Second Law in the horizontal direction: F_app - f = ma (where 'a' is the horizontal acceleration). In the vertical direction: N = W (assuming no vertical movement).\n\n**3. Applying Newton's Second Law in Different Scenarios**\n\nNewton's second law is our key to solving many problems. Here's how we apply it:\n\n1.  **Draw the FBD:** Always start with a clear FBD of the object you're analyzing.\n2.  **Choose a coordinate system:** Pick a convenient coordinate system (usually x and y axes) that aligns with the problem. The choice of a coordinate system can significantly simplify calculations. For instance, if an object moves along an inclined plane, it might be easier to choose axes parallel and perpendicular to the incline instead of horizontal and vertical axes.\n3.  **Resolve forces into components:** If any forces are at angles to the chosen axes, resolve them into their horizontal (x) and vertical (y) components using trigonometry (sine and cosine).\n4.  **Apply Newton's second law:** Apply F = ma separately for each axis. Sum all the force components acting in the x-direction and set it equal to ma_x and sum all force components in y-direction and set equal to ma_y\n    * ΣFx = max\n    * ΣFy = may\n5. **Solve for unknown quantities:** Use the equations obtained in step 4 to solve for unknown quantities, such as acceleration, forces, or mass.\n\n**Example 3: Atwood Machine**\n\nThe Atwood machine is a classic example involving two masses connected by a string over a pulley. Let's analyze a simplified case where the pulley is massless and frictionless.\n\n1.  **FBD:**\n    *   For mass m1, there's tension (T) upwards and weight (W1 = m1g) downwards.\n    *   For mass m2, there's tension (T) upwards and weight (W2 = m2g) downwards.\n2.  **Coordinate System:** Let's consider upwards as positive for both masses.\n3.  **Newton's Second Law:**\n    *   For m1: T - m1g = m1a\n    *   For m2: T - m2g = -m2a (Note the negative sign since positive direction is upwards and m2 accelerates downwards.)\n4.  **Solving:** Solving these two equations simultaneously (by substituting for T) we can find the acceleration of the system and the tension in the string. The acceleration will be a = (m1-m2)g / (m1+m2) and the tension will be T = 2m1m2g/(m1+m2). (The detailed derivation would take time and can be done separately)\n\n**4.  Understanding Different Types of Motion**\n\nAs we move through the syllabus, you’ll encounter different types of motion that build upon these basics:\n\n*   **Uniform Motion:**  Constant velocity (zero acceleration). The net force is zero.\n*   **Uniformly Accelerated Motion:** Constant acceleration. The net force is constant. Equations of motion (SUVAT equations) are applicable.\n*   **Non-Uniform Motion:** Changing acceleration. Requires calculus for complete analysis.\n\n**5. Looking Ahead**\n\nIn the coming chapters, we'll build on these concepts:\n\n*   **Friction:**  Detailed study of static and kinetic friction.\n*   **Work and Energy:** How forces transfer energy.\n*   **Circular Motion:** Forces and motion in a circular path.\n*   **Rotational Motion:** Forces and motion of rotating objects.\n\n**Key Takeaways:**\n\n*   Master the art of drawing FBDs; it's the foundation of solving force problems.\n*   Apply Newton's Second Law systematically: F = ma in each direction.\n*   Practice a variety of problems to solidify your understanding.\n*   Be comfortable with resolving forces into components.\n\nThis chapter is your essential toolkit for solving a large chunk of JEE physics problems. Invest the time to truly grasp these concepts, and you'll see your confidence soar. We will tackle more complex problems in the next chapter which will truly put your understanding to the test. Good luck and keep practicing!",
        "chapter3": "# Simple Harmonic Motion and Oscillations: Analysis and Variations\n\n**Introduction**\n\nWelcome to the crucial chapter on Simple Harmonic Motion (SHM) and Oscillations! In previous chapters, we've laid the groundwork for understanding forces and energy, and now we're going to use those concepts to explore a very specific, and remarkably common, type of motion: oscillatory motion. While not all oscillations are simple harmonic, SHM is a particularly beautiful and tractable case that serves as a building block for understanding more complex systems. This chapter will not only define SHM but also delve into its analysis, variations, and how it relates to the energy of the system. Get ready to understand a fundamental aspect of physics that shows up everywhere, from clocks to atoms.\n\n**What is Oscillatory Motion?**\n\nBefore we jump into SHM, let’s define oscillations. Oscillatory motion is any repetitive motion back and forth around a central or equilibrium position. Think of a swing, a pendulum, or a vibrating string on a guitar. These are all examples of oscillatory motion. Key characteristics of oscillatory motion are:\n\n*   **Equilibrium Position:** The position where there’s no net force on the object.\n*   **Displacement:** The distance of the object from the equilibrium position.\n*   **Restoring Force:** A force that always pulls the object back toward the equilibrium position.\n\n**Introducing Simple Harmonic Motion (SHM)**\n\nSimple Harmonic Motion is a *special* type of oscillatory motion. It's characterized by a very specific relationship between the restoring force and the displacement:\n\n*   **Restoring Force is Proportional to Displacement:** In SHM, the restoring force is directly proportional to the displacement and acts in the opposite direction. Mathematically, this is expressed as:\n\n    *   *F = -kx*\n\n        *   Where:\n            *   *F* is the restoring force.\n            *   *x* is the displacement from the equilibrium position.\n            *   *k* is a positive constant called the spring constant (or force constant). The negative sign indicates that the force opposes the displacement.\n\n*   **Constant Amplitude and Frequency:** An ideal SHM continues indefinitely with the same maximum displacement (amplitude) and oscillates with the same frequency. In reality, friction and other dissipative forces will cause these values to change over time (damped oscillations).\n\n**Mathematical Description of SHM**\n\nThe equation *F = -kx* is a crucial starting point, but we can derive a lot more from it. Let's use Newton’s second law, *F = ma*:\n\n*   *ma = -kx*\n\n    *   Where *m* is the mass of the object and *a* is its acceleration.\n\n*   Rearranging, we get: *a = -(k/m)x*\n\n    *   This shows that the acceleration is proportional to the displacement and also acts in the opposite direction.\n*   This leads us to a very important relationship – the angular frequency (*ω*): *ω² = k/m* or *ω = √(k/m)*\n*   The differential equation describing SHM is thus:\n\n    *   *d²x/dt² + ω²x = 0*\n\n        *   Where d²x/dt² is the second derivative of displacement with respect to time (i.e., acceleration).\n\n*   The general solution to this differential equation is:\n\n    *   *x(t) = A cos(ωt + φ)*\n\n        *   Where:\n            *   *x(t)* is the displacement as a function of time.\n            *   *A* is the amplitude (maximum displacement).\n            *   *ω* is the angular frequency (rad/s).\n            *   *t* is the time.\n            *   *φ* is the phase constant (initial phase, determines the position of the object at t=0)\n\n**Key Parameters of SHM**\n\nLet’s break down the crucial parameters of SHM further:\n\n1.  **Amplitude (A):** The maximum displacement from the equilibrium position. It determines the \"extent\" of the oscillation. The unit of amplitude is meters (m).\n\n2.  **Angular Frequency (ω):** It’s related to the speed of oscillation.  *ω = 2πf = 2π/T*, where *f* is the frequency (in Hertz) and *T* is the period (in seconds).\n    *   Frequency (f): The number of complete oscillations per second (unit: Hertz, Hz).\n    *   Period (T): The time taken for one complete oscillation (unit: seconds, s).\n\n3.  **Phase Constant (φ):** Also known as the initial phase, this tells you the position of the object at t=0. It affects the starting point of the motion. Phase is measured in radians.\n\n**Graphical Representation of SHM**\n\nThe displacement-time graph of SHM is sinusoidal (a cosine or sine wave). The x(t) = A cos(ωt + φ) equation essentially dictates the shape of this graph:\n\n*   The *amplitude* dictates how \"tall\" the wave is.\n*   The *angular frequency* determines how \"squished\" or \"stretched out\" the wave is in the time dimension (determines the period).\n*   The *phase constant* shifts the whole graph left or right on the time axis.\n\n**Velocity and Acceleration in SHM**\n\nHaving a good understanding of displacement is crucial, but so are velocity and acceleration within SHM. These are calculated by taking the time derivatives of the displacement equation:\n\n1.  **Velocity (v(t)):**  The first derivative of displacement with respect to time.\n\n    *   *v(t) = -Aω sin(ωt + φ)*\n\n    *  Note that this is also a sinusoidal function but is out of phase with the displacement by π/2 radians. This means the velocity is maximum when displacement is zero (at equilibrium) and zero when the displacement is maximum (at the extremes).\n2.  **Acceleration (a(t)):** The first derivative of velocity with respect to time, or the second derivative of displacement.\n\n    *   *a(t) = -Aω² cos(ωt + φ)*\n    *   *a(t) = -ω²x(t)* (From here, you can see why a is proportional to x and in opposite directions)\n\n    *  Note again that acceleration is also sinusoidal but is in the opposite direction to the displacement, and also follows the same equation as the position with an added ω². Acceleration is maximum (in magnitude) when displacement is maximum and is zero at the equilibrium position.\n\n**Energy in SHM**\n\nSHM also provides a beautiful example of energy transformation and conservation:\n\n*   **Potential Energy (PE):** This is the energy stored in the system due to the displacement of the object from its equilibrium position. In the case of spring mass system, the potential energy is related to the extension/compression of the spring.\n    *   *PE = ½kx²*\n    *   Using the SHM solution *x(t) = A cos(ωt + φ)* , we can write:  *PE = ½kA²cos²(ωt + φ)*\n*   **Kinetic Energy (KE):** This is the energy possessed by the object due to its motion.\n    *   *KE = ½mv²*\n    *  Using the SHM solution *v(t) = -Aω sin(ωt + φ)*, we can write: *KE = ½mA²ω²sin²(ωt + φ)*\n    *   We know that *ω² = k/m*  so,  *KE = ½kA²sin²(ωt + φ)*\n\n*   **Total Mechanical Energy (E):** The sum of potential and kinetic energy.\n    *   *E = PE + KE*\n    *   *E = ½kA²cos²(ωt + φ)  + ½kA²sin²(ωt + φ) = ½kA²(cos²(ωt + φ) + sin²(ωt + φ))*\n    *   *E = ½kA²* (Since, *cos²θ + sin²θ = 1)*\n\n    *   **Key Insight:** The total mechanical energy of the system in SHM is constant and proportional to the square of the amplitude. This result is fundamental in understanding how energy is conserved in oscillatory systems. Note that in the absence of damping (friction), the total mechanical energy of the system remains constant. The energy continuously transforms from potential to kinetic and vice versa, but the total remains the same.\n\n**Variations of SHM**\n\nWhile a simple spring-mass system provides a clear demonstration of SHM, it’s useful to know that SHM can exist in other systems:\n\n*   **Simple Pendulum:** For small angle oscillations, the motion of a pendulum can be approximated as SHM. The restoring force is due to gravity.\n*   **LC Circuits:** In electrical circuits with an inductor (L) and capacitor (C), the charge and current oscillate with SHM (electrical oscillations).\n\n**Examples**\n\n1.  **Spring-Mass System:** A 0.5 kg mass is attached to a spring with a spring constant of 20 N/m.  Initially, it’s displaced by 0.1 m and released. Calculate:\n    *   Angular frequency (ω):  *ω = √(k/m) = √(20/0.5) = √40 ≈ 6.32 rad/s*\n    *   Period (T): *T = 2π/ω = 2π/6.32 ≈ 0.99 s*\n    *   Amplitude (A): 0.1 m (Given)\n    *   Total Energy (E): *E = ½kA² = ½ * 20 * (0.1)² = 0.1 J*\n\n2.  **Simple Pendulum:** A pendulum with a length of 1 meter oscillates with a small angle of displacement. Assuming *g = 9.8 m/s²*, calculate its period.\n    *    For a small-angle pendulum, the time period is given by *T = 2π√(L/g) = 2π√(1/9.8) ≈ 2.01 s*\n\n**Important Considerations**\n\n*   **Damping:** In real-world situations, friction and other dissipative forces cause the amplitude of SHM to decrease over time, leading to damped oscillations.\n*   **Forced Oscillations and Resonance:** If we apply an external periodic force to a system exhibiting SHM, we can induce forced oscillations. When the frequency of the external force matches the natural frequency of the system, we observe a phenomenon called resonance, where the amplitude of the oscillations becomes very large. This is a crucial concept for later chapters.\n\n**Conclusion**\n\nThis chapter on Simple Harmonic Motion and Oscillations has explored the fundamental principles of a very common type of motion. We've covered the mathematical description of SHM, its key parameters, its energy aspects, and variations of SHM. This foundation is crucial for the upcoming chapters that deal with waves and other complex phenomena. Remember the equation *F = -kx* and *x(t) = A cos(ωt + φ)*, as they are your constant companions for further study. Be sure to practice the examples provided to ensure you’re solid on the fundamentals before moving ahead.",
        "chapter4": "# Force, Motion, and Newton's Laws: Essential Applications\n\nOkay, everyone. Let's dive into a fundamental area of physics that's crucial for tackling JEE problems: Force, Motion, and Newton's Laws. We've already covered the basics in the previous chapters – what forces *are*, how to represent them, and Newton's three laws. Now, we're going to put those concepts into practice and see how they apply to real-world scenarios and the kind of problems you'll face on the JEE exam. This chapter is all about getting comfortable with *applying* what you know.\n\n**1. Recap: Newton's Laws of Motion**\n\nBefore we jump into applications, let’s quickly refresh our memory:\n\n*   **Newton’s First Law (Law of Inertia):** An object at rest stays at rest, and an object in motion stays in motion with the same speed and in the same direction unless acted upon by an unbalanced force. Essentially, objects resist changes in their state of motion.\n\n*   **Newton's Second Law:** The acceleration of an object is directly proportional to the net force acting on it and inversely proportional to its mass.  Mathematically, this is expressed as **F = ma**, where F is the net force, m is the mass, and a is the acceleration. Remember, force and acceleration are vector quantities, meaning they have both magnitude and direction.\n\n*   **Newton's Third Law:** For every action, there is an equal and opposite reaction. If object A exerts a force on object B, object B will exert an equal force back on object A, but in the opposite direction. These action-reaction forces always act on *different* objects.\n\n**2. Free Body Diagrams (FBDs): The Cornerstone of Problem Solving**\n\nThe single most important skill for solving problems involving Newton's Laws is the ability to draw a **Free Body Diagram (FBD)**. An FBD isolates a single object and shows *all* the forces acting *on* that object. Here's a step-by-step guide:\n\n1.  **Isolate the object:** Imagine a circle or a dot representing the object you're analyzing.\n2.  **Identify all forces:** Consider all the forces acting on the object. Common forces include:\n    *   **Weight (W):** Force due to gravity, always acting downwards. W = mg, where g is the acceleration due to gravity (approximately 9.8 m/s² on Earth).\n    *   **Normal Force (N):** The force exerted by a surface on an object in contact with it, acting perpendicular to the surface.\n    *   **Tension (T):** Force exerted by a rope, string, or cable, acting along the direction of the rope.\n    *   **Friction (f):** A force that opposes motion between two surfaces in contact. We'll delve deeper into friction later.\n    *   **Applied Force (F_app):** Any force directly applied to the object (pushing, pulling, etc.).\n3.  **Draw vectors:** Represent each force as an arrow (vector) originating from the center of the object. The length of the arrow represents the magnitude of the force, and the direction of the arrow represents the direction of the force.\n4.  **Label the forces:** Label each force clearly (W, N, T, f, F_app, etc.).\n\n**Example 1: A Block on a Horizontal Surface**\n\nLet's consider a block of mass 'm' resting on a horizontal surface.\n\n1.  **Object:** The block.\n2.  **Forces:**\n    *   Weight (W = mg) acting downwards.\n    *   Normal force (N) acting upwards.\n3.  **FBD:** Draw a dot, an arrow pointing downwards labelled 'W', and an arrow pointing upwards labeled 'N'.\n4.  **Analysis:** Since the block is at rest, it's in equilibrium. According to Newton's First Law, the net force is zero. Therefore, N = W, or N = mg.\n\n**Example 2: A Block Being Pulled on a Horizontal Surface**\n\nNow, let's say the same block is being pulled horizontally by a force F_app.\n\n1.  **Object:** The block.\n2.  **Forces:**\n    *   Weight (W = mg) acting downwards.\n    *   Normal force (N) acting upwards.\n    *   Applied force (F_app) acting horizontally.\n    *   If there is friction between the block and the surface, a frictional force (f) opposing the motion will act horizontally.\n3.  **FBD:** Draw a dot, an arrow pointing downwards labelled 'W', an arrow pointing upwards labeled 'N', an arrow pointing to the right labeled 'F_app', and an arrow pointing to the left labelled 'f' (if friction is present).\n4.  **Analysis:** The block will accelerate in the horizontal direction. Applying Newton's Second Law in the horizontal direction: F_app - f = ma (where 'a' is the horizontal acceleration). In the vertical direction: N = W (assuming no vertical movement).\n\n**3. Applying Newton's Second Law in Different Scenarios**\n\nNewton's second law is our key to solving many problems. Here's how we apply it:\n\n1.  **Draw the FBD:** Always start with a clear FBD of the object you're analyzing.\n2.  **Choose a coordinate system:** Pick a convenient coordinate system (usually x and y axes) that aligns with the problem. The choice of a coordinate system can significantly simplify calculations. For instance, if an object moves along an inclined plane, it might be easier to choose axes parallel and perpendicular to the incline instead of horizontal and vertical axes.\n3.  **Resolve forces into components:** If any forces are at angles to the chosen axes, resolve them into their horizontal (x) and vertical (y) components using trigonometry (sine and cosine).\n4.  **Apply Newton's second law:** Apply F = ma separately for each axis. Sum all the force components acting in the x-direction and set it equal to ma_x and sum all force components in y-direction and set equal to ma_y\n    * ΣFx = max\n    * ΣFy = may\n5. **Solve for unknown quantities:** Use the equations obtained in step 4 to solve for unknown quantities, such as acceleration, forces, or mass.\n\n**Example 3: Atwood Machine**\n\nThe Atwood machine is a classic example involving two masses connected by a string over a pulley. Let's analyze a simplified case where the pulley is massless and frictionless.\n\n1.  **FBD:**\n    *   For mass m1, there's tension (T) upwards and weight (W1 = m1g) downwards.\n    *   For mass m2, there's tension (T) upwards and weight (W2 = m2g) downwards.\n2.  **Coordinate System:** Let's consider upwards as positive for both masses.\n3.  **Newton's Second Law:**\n    *   For m1: T - m1g = m1a\n    *   For m2: T - m2g = -m2a (Note the negative sign since positive direction is upwards and m2 accelerates downwards.)\n4.  **Solving:** Solving these two equations simultaneously (by substituting for T) we can find the acceleration of the system and the tension in the string. The acceleration will be a = (m1-m2)g / (m1+m2) and the tension will be T = 2m1m2g/(m1+m2). (The detailed derivation would take time and can be done separately)\n\n**4.  Understanding Different Types of Motion**\n\nAs we move through the syllabus, you’ll encounter different types of motion that build upon these basics:\n\n*   **Uniform Motion:**  Constant velocity (zero acceleration). The net force is zero.\n*   **Uniformly Accelerated Motion:** Constant acceleration. The net force is constant. Equations of motion (SUVAT equations) are applicable.\n*   **Non-Uniform Motion:** Changing acceleration. Requires calculus for complete analysis.\n\n**5. Looking Ahead**\n\nIn the coming chapters, we'll build on these concepts:\n\n*   **Friction:**  Detailed study of static and kinetic friction.\n*   **Work and Energy:** How forces transfer energy.\n*   **Circular Motion:** Forces and motion in a circular path.\n*   **Rotational Motion:** Forces and motion of rotating objects.\n\n**Key Takeaways:**\n\n*   Master the art of drawing FBDs; it's the foundation of solving force problems.\n*   Apply Newton's Second Law systematically: F = ma in each direction.\n*   Practice a variety of problems to solidify your understanding.\n*   Be comfortable with resolving forces into components.\n\nThis chapter is your essential toolkit for solving a large chunk of JEE physics problems. Invest the time to truly grasp these concepts, and you'll see your confidence soar. We will tackle more complex problems in the next chapter which will truly put your understanding to the test. Good luck and keep practicing!"
    },
    "questions": {
        "chapter5": "Chapter 5: Simple Harmonic Motion and Oscillations: Analysis and Variations\n\nQuestion 1: A particle executes Simple Harmonic Motion (SHM) with an amplitude A and time period T. What fraction of the total energy is kinetic when the displacement from the mean position is A/2?\n\nQuestion 2: A simple pendulum has a length L and oscillates with a time period T on the surface of the Earth. If this pendulum were to be taken to a planet where the acceleration due to gravity is four times that of the Earth, what would be the new time period of oscillation in terms of T?\n\nQuestion 3: A block of mass 'm' is attached to a spring with spring constant 'k'. It is pulled a distance 'x' from its equilibrium position and released. Determine the velocity of the block when it is at a distance x/2 from the equilibrium position, assuming no frictional forces.\n\nQuestion 4: Explain qualitatively how damping affects the amplitude and energy of a simple harmonic oscillator over time. Describe three real-world examples of damping in oscillatory motion.\n\nQuestion 5: Two springs with spring constants k1 and k2 are connected in series. A mass 'm' is attached to the free end of the series combination. What is the effective spring constant of this series combination and hence derive the expression for the time period of oscillations?\n\nQuestion 6: A particle is simultaneously subjected to two SHM's, one along the x-axis, x = A sin(ωt) and another along the y-axis, y = A sin(ωt + π/2). Describe the trajectory of the particle.\n\nQuestion 7: A cylindrical buoy of radius 'r' and density 'ρ' floats upright in water of density 'ρw'. When displaced slightly from equilibrium and released, it undergoes vertical oscillations. Derive the expression for the time period of these oscillations. (Assume ρ < ρw)\n\nQuestion 8: A simple pendulum is set up in an accelerating elevator. If the elevator is accelerating upwards with an acceleration 'a', derive the expression for the new time period of the pendulum in terms of the original time period when the elevator was at rest.\n\nQuestion 9: Consider a system with a spring of spring constant k attached to a mass m. This mass is now moving on a horizontal surface with friction, the coefficient of kinetic friction being μ. If the spring is stretched to an amplitude A, how many oscillations will the mass execute before it comes to rest?\n\nQuestion 10: A physical pendulum consists of a thin rod of length L and mass M, pivoted at one end. Find the expression for its time period of oscillation for small angular displacements. Then, find the equivalent length of a simple pendulum that would have the same time period.",
        "chapter3": "Chapter chapter3:\nQuestion 1: A block of mass 'm' is pulled by a force 'F' at an angle θ with the horizontal along a rough horizontal surface with a coefficient of kinetic friction 'μ'. Derive an expression for the work done by the force 'F' in displacing the block a distance 'd'. Also, determine the work done by the frictional force and the net work done on the block.\n\nQuestion 2: A pump is used to lift water from a well of depth 'h' and delivers it at a height 'H' above the ground. If 'm' kg of water is lifted per second, and the efficiency of the pump is 'η', calculate the power input to the pump. Discuss how the efficiency affects the total energy consumption.\n\nQuestion 3: A projectile is launched with an initial velocity 'v0' at an angle 'θ' with respect to the horizontal. Neglecting air resistance, demonstrate using energy conservation principles that the speed of the projectile at its highest point is 'v0cos(θ)'. Explain why the kinetic energy is not zero at the highest point.\n\nQuestion 4: A spring with spring constant 'k' is compressed by a distance 'x' from its natural length. If a block of mass 'm' is placed against the spring and then released, calculate the maximum speed of the block and the maximum distance the block travels on a frictionless horizontal surface. How would these values change if the horizontal surface had friction?\n\nQuestion 5: A car of mass 'M' is moving on a horizontal circular track of radius 'R' with a constant speed 'v'. Is the work done by the centripetal force on the car non-zero? Justify your answer with suitable explanations, relating it to the concept of energy transfer and force directions.\n\nQuestion 6: A particle of mass 'm' is subjected to a conservative force described by the potential energy function U(x) = ax² + bx³, where 'a' and 'b' are constants. Determine the expression for the force acting on the particle as a function of position 'x'. Find the points where the particle is in equilibrium, and classify the nature of equilibrium at these points.\n\nQuestion 7: A pendulum bob of mass 'm' is released from an initial angle 'θ' with the vertical. Derive an expression for the speed of the bob at the lowest point of its swing. What assumptions do you make, and how do they impact the derived equation?\n\nQuestion 8: A bullet of mass 'm' moving horizontally with speed 'v' hits a stationary wooden block of mass 'M' resting on a frictionless surface. The bullet gets embedded in the block. Calculate the final velocity of the block-bullet system using the principle of conservation of linear momentum and calculate the kinetic energy lost in this process. What does this loss of kinetic energy represent?\n\nQuestion 9: A 2 kg object is acted upon by a variable force F(x) = 3x² - 5x + 2, where F is in Newtons and x is in meters. If the object starts from rest at x=0, calculate its kinetic energy at x=3m and the work done by the force in this interval.\n\nQuestion 10: Two springs, with spring constants k1 and k2, are connected in series. If the combined system has an effective spring constant 'k', derive an expression for 'k' in terms of k1 and k2. How does this relate to the energy stored in the system? Would the scenario be different if the two springs were connected in parallel? Explain.",
        "chapter4": "Chapter chapter4:\nQuestion 1: A rigid body is rotating about a fixed axis. How does the angular velocity of a particle on the body change with its distance from the axis of rotation? Explain your reasoning, specifically addressing if particles at different distances have the same or different angular velocities.\n\nQuestion 2: A disc and a hoop, both of equal mass and radius, are released simultaneously from rest at the top of an inclined plane. Which object will reach the bottom first? Justify your answer based on their moments of inertia and the conservation of energy.\n\nQuestion 3: Define torque. Explain how torque depends on the force applied and the position vector relative to the axis of rotation. Provide an example illustrating how the same force can result in different torques.\n\nQuestion 4: A particle of mass 'm' is moving with a velocity 'v' along a straight line. Calculate the magnitude of its angular momentum with respect to a point not on the line of motion. Describe how this angular momentum would change if the point of reference was moved closer to the line of motion.\n\nQuestion 5: A uniform rod of mass 'M' and length 'L' is pivoted at one end and is free to rotate in a vertical plane. If the rod is released from rest in a horizontal position, what is its angular acceleration at the instant it is released and what is the linear acceleration of the free end at that moment?\n\nQuestion 6: A system consists of two particles with masses m1 and m2, located at positions r1 and r2 respectively.  Explain what is meant by the net torque acting on the system and what condition must be met for the total angular momentum of the system to be conserved.\n\nQuestion 7: A solid sphere is rolling without slipping on a horizontal surface. If its total kinetic energy is 'K', what fraction of this energy is translational kinetic energy and what fraction is rotational kinetic energy?\n\nQuestion 8: A grinding wheel is initially rotating at a speed of 300 rpm. After the power is cut off, it decelerates uniformly and comes to rest in 20 seconds. Calculate the angular deceleration of the wheel and the number of revolutions it makes before coming to rest.\n\nQuestion 9: A cyclist is going around a circular track. If the cyclist leans inward while turning, explain how this affects the torque due to their weight relative to the axis of rotation formed by the contact points of the tires with the ground.\n\nQuestion 10: Two flywheels, A and B, have the same mass and are made of the same material. Flywheel A has twice the radius of Flywheel B. Which flywheel would require more energy to be brought up to the same rotational speed and why? Justify your answer based on the relation between moment of inertia, mass and radius.",
        "chapter1": "Chapter 5: Simple Harmonic Motion and Oscillations: Analysis and Variations\n\nQuestion 1: A particle executes Simple Harmonic Motion (SHM) with an amplitude A and time period T. What fraction of the total energy is kinetic when the displacement from the mean position is A/2?\n\nQuestion 2: A simple pendulum has a length L and oscillates with a time period T on the surface of the Earth. If this pendulum were to be taken to a planet where the acceleration due to gravity is four times that of the Earth, what would be the new time period of oscillation in terms of T?\n\nQuestion 3: A block of mass 'm' is attached to a spring with spring constant 'k'. It is pulled a distance 'x' from its equilibrium position and released. Determine the velocity of the block when it is at a distance x/2 from the equilibrium position, assuming no frictional forces.\n\nQuestion 4: Explain qualitatively how damping affects the amplitude and energy of a simple harmonic oscillator over time. Describe three real-world examples of damping in oscillatory motion.\n\nQuestion 5: Two springs with spring constants k1 and k2 are connected in series. A mass 'm' is attached to the free end of the series combination. What is the effective spring constant of this series combination and hence derive the expression for the time period of oscillations?\n\nQuestion 6: A particle is simultaneously subjected to two SHM's, one along the x-axis, x = A sin(ωt) and another along the y-axis, y = A sin(ωt + π/2). Describe the trajectory of the particle.\n\nQuestion 7: A cylindrical buoy of radius 'r' and density 'ρ' floats upright in water of density 'ρw'. When displaced slightly from equilibrium and released, it undergoes vertical oscillations. Derive the expression for the time period of these oscillations. (Assume ρ < ρw)\n\nQuestion 8: A simple pendulum is set up in an accelerating elevator. If the elevator is accelerating upwards with an acceleration 'a', derive the expression for the new time period of the pendulum in terms of the original time period when the elevator was at rest.\n\nQuestion 9: Consider a system with a spring of spring constant k attached to a mass m. This mass is now moving on a horizontal surface with friction, the coefficient of kinetic friction being μ. If the spring is stretched to an amplitude A, how many oscillations will the mass execute before it comes to rest?\n\nQuestion 10: A physical pendulum consists of a thin rod of length L and mass M, pivoted at one end. Find the expression for its time period of oscillation for small angular displacements. Then, find the equivalent length of a simple pendulum that would have the same time period.",
        "chapter2": "Chapter Force, Motion, and Newton's Laws: Essential Applications:\n\nQuestion 1: A block of mass 'm' is placed on a rough inclined plane with an angle θ. The coefficient of static friction between the block and the plane is μs. What is the minimum force, applied parallel to the inclined plane and upwards, required to prevent the block from sliding down? Express your answer in terms of m, g, θ, and μs.\n\nQuestion 2: Two blocks, A and B, with masses m1 and m2 respectively, are connected by a light, inextensible string passing over a frictionless pulley. Block A rests on a horizontal, frictionless surface, while block B hangs vertically. If the system is released from rest, derive an expression for the acceleration of the blocks and the tension in the string.\n\nQuestion 3: A car of mass 'M' is moving at a constant speed 'v' on a level road. The coefficient of rolling friction between the tires and the road is μr. If the car is brought to rest by applying brakes, what is the minimum distance the car will travel before stopping?\n\nQuestion 4: Consider a projectile launched at an angle θ with an initial velocity v0. Neglecting air resistance, at what angle will the projectile achieve its maximum horizontal range? Justify your answer using relevant kinematic equations.\n\nQuestion 5: A small ball of mass ‘m’ is attached to a string and whirled in a vertical circle. If the speed of the ball at the highest point of the circle is ‘v’, what is the tension in the string at the lowest point of the circle, assuming the radius of the circle is 'r'?\n\nQuestion 6: A rocket of mass 'M' is accelerating vertically upwards with an acceleration 'a'. If the rocket ejects fuel at a rate of 'dm/dt' with an exhaust velocity 've' relative to the rocket, derive an expression for the thrust force exerted by the fuel.\n\nQuestion 7:  A box of mass 10 kg is pulled across a horizontal floor with a force of 50 N at an angle of 30° to the horizontal. If the coefficient of kinetic friction between the box and the floor is 0.2, calculate the acceleration of the box. Assume g = 9.8 m/s².\n\nQuestion 8: Explain, using Newton's third law, why a swimmer propels themselves forward in the water. Be specific about the forces involved and their directions.\n\nQuestion 9:  A particle moves in a circular path of radius R with a non-uniform speed. The tangential acceleration at some instant is 'at' and the centripetal acceleration is 'ac'. If both accelerations are non-zero, describe qualitatively how the magnitude of the net acceleration vector changes.\n\nQuestion 10: A uniform rope of mass 'M' and length 'L' is suspended vertically from one end. Calculate the tension in the rope at a distance 'x' from the top end of the rope."
    }
}